{
  "_name_or_path": "AutoTrain",
  "_num_labels": 41,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "#",
    "1": "$",
    "2": "''",
    "3": "(",
    "4": ")",
    "5": ",",
    "6": ".",
    "7": ":",
    "8": "CC",
    "9": "CD",
    "10": "DT",
    "11": "EX",
    "12": "FW",
    "13": "IN",
    "14": "JJ",
    "15": "JJR",
    "16": "JJS",
    "17": "MD",
    "18": "NN",
    "19": "NNP",
    "20": "NNS",
    "21": "PDT",
    "22": "POS",
    "23": "PRP",
    "24": "PRP$",
    "25": "RB",
    "26": "RBR",
    "27": "RBS",
    "28": "RP",
    "29": "SYM",
    "30": "TO",
    "31": "UH",
    "32": "VB",
    "33": "VBD",
    "34": "VBG",
    "35": "VBN",
    "36": "VBP",
    "37": "VBZ",
    "38": "WDT",
    "39": "WRB",
    "40": "``"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "#": 0,
    "$": 1,
    "''": 2,
    "(": 3,
    ")": 4,
    ",": 5,
    ".": 6,
    ":": 7,
    "CC": 8,
    "CD": 9,
    "DT": 10,
    "EX": 11,
    "FW": 12,
    "IN": 13,
    "JJ": 14,
    "JJR": 15,
    "JJS": 16,
    "MD": 17,
    "NN": 18,
    "NNP": 19,
    "NNS": 20,
    "PDT": 21,
    "POS": 22,
    "PRP": 23,
    "PRP$": 24,
    "RB": 25,
    "RBR": 26,
    "RBS": 27,
    "RP": 28,
    "SYM": 29,
    "TO": 30,
    "UH": 31,
    "VB": 32,
    "VBD": 33,
    "VBG": 34,
    "VBN": 35,
    "VBP": 36,
    "VBZ": 37,
    "WDT": 38,
    "WRB": 39,
    "``": 40
  },
  "layer_norm_eps": 1e-12,
  "max_length": 256,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 0,
  "padding": "max_length",
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 29794
}
